http_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="host1" use_controller_vm="true" maxusers="20" cpu="2" weight="1" use_controller_vm="true">
    	<ip value="192.168.2.217"></ip> 
		<ip value="192.168.2.218"></ip>
		<ip value="192.168.2.219"></ip> 
		<ip value="192.168.2.220"></ip>
		<ip value="192.168.2.221"></ip> 
		<ip value="192.168.2.222"></ip>
		<ip value="192.168.2.223"></ip> 
		<ip value="192.168.2.224"></ip>
    </client>
    <client host="host2" use_controller_vm="true" maxusers="20" cpu="2" weight="2" use_controller_vm="true">
    	<ip value="192.168.3.217"></ip> 
		<ip value="192.168.3.218"></ip>
		<ip value="192.168.3.219"></ip> 
		<ip value="192.168.3.220"></ip>
		<ip value="192.168.3.221"></ip> 
		<ip value="192.168.3.222"></ip>
		<ip value="192.168.3.223"></ip> 
		<ip value="192.168.3.224"></ip>
    </client>
  </clients>
  
  <!-- Server side setup -->
  <servers>
  		<server host="73f7j2.vc.c4.catn.com" port="80" type="tcp"></server>
  </servers>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
     <arrivalphase phase="1" duration="3" unit="minute">
    	<users interarrival="5" unit="second"></users>
     </arrivalphase>
     <arrivalphase phase="2" duration="5" unit="minute">
    	<users interarrival="2" unit="second"></users>
     </arrivalphase>
     <arrivalphase phase="3" duration="10" unit="minute">
    	<users interarrival="0.1" unit="second"></users>
     </arrivalphase>
   </load>

  <options>
     <option type="ts_http" name="user_agent">
       <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
       <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
     </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="index-to-wordpress" probability="60" type="ts_http">
    <!-- full url with server name, this overrides the "server" config value -->
    <request> <http url="/" method="GET" version="1.1"></http> </request>
    <request> <http url="/wordpress" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    
    <thinktime value="15" random="true"></thinktime>
    
	<request> <http url="/wordpress.?p=1" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
	
    <thinktime value="20" random="true"></thinktime>
  </session>
  
    <session name="wordpress-only-login" probability="60" type="ts_http">
    <!-- full url with server name, this overrides the "server" config value -->
    <request> <http url="/wordpress/?page_id=2" method="GET" version="1.1"></http> </request>
    
    <thinktime value="15" random="true"></thinktime>
    
    <request> <http url="/wordpress/?m=201307" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    
    <thinktime value="20" random="true"></thinktime>
        
	<request> <http url="/wordpress/wp-login.php" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
	
  </session>
 </sessions>
</tsung>